In [1]:
import pandas as pd
import numpy as np

# Assignment on Customers data set on Encoding Technique, Submitted By: Ramen Kumar Das

In [2]:
df=pd.read_csv('Customers.csv')

In [3]:
df.head()

    age  income  gender m_status buys
0  25.0    high    male   single   no
1  25.0    high    male  married   no
2  35.0    high    male   single  yes
3  35.0  medium    male   single  yes
4  30.0     low  female   single  yes

In [4]:
df.isnull().sum()

age         2
income      0
gender      0
m_status    1
buys        0
dtype: int64

In [5]:
fill=df.age.mean()

In [6]:
df.age=df.age.fillna(fill)

In [7]:
df.isnull().sum()

age         0
income      0
gender      0
m_status    1
buys        0
dtype: int64

# Removing the null value of categorical column m_status

In [8]:
fill1=df.m_status.mode()
fill1

0    single
dtype: object

In [9]:
df.m_status=df.m_status.fillna('single')

In [10]:
df.isnull().sum()

age         0
income      0
gender      0
m_status    0
buys        0
dtype: int64

In [11]:
df.head()

    age  income  gender m_status buys
0  25.0    high    male   single   no
1  25.0    high    male  married   no
2  35.0    high    male   single  yes
3  35.0  medium    male   single  yes
4  30.0     low  female   single  yes

In [12]:
df1=df.drop(['age','income'],axis=1)
df1.head()

   gender m_status buys
0    male   single   no
1    male  married   no
2    male   single  yes
3    male   single  yes
4  female   single  yes

# Label---------Encoder for column gender,m_status,buys

In [13]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [14]:
for column in df1.columns:
    if df1[column].dtype==np.number:
        continue
    df1[column]=le.fit_transform(df1[column])

<ipython-input-14-967aedaee73f>:2: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df1[column].dtype==np.number:

In [15]:
df1.head()

   gender  m_status  buys
0       1         1     0
1       1         0     0
2       1         1     1
3       1         1     1
4       0         1     1

In [16]:
df.head()

    age  income  gender m_status buys
0  25.0    high    male   single   no
1  25.0    high    male  married   no
2  35.0    high    male   single  yes
3  35.0  medium    male   single  yes
4  30.0     low  female   single  yes

# Drop the column 3 ,4,5 & it is df2

In [17]:
df2=df.drop(['gender','m_status','buys'],axis=1)# Drop the column 3 ,4,5 & it is df2

In [18]:
df2.head()

    age  income
0  25.0    high
1  25.0    high
2  35.0    high
3  35.0  medium
4  30.0     low

# Doing the Ordinal Encoding only for income column

In [20]:
incrange=['high','medium','low']
from sklearn.preprocessing import OrdinalEncoder
oe= OrdinalEncoder(categories=[incrange])

In [21]:
encoded=oe.fit_transform(df2[['income']])

In [24]:
new=pd.DataFrame(encoded,columns=['income'])

In [25]:
new.head()

   income
0     0.0
1     0.0
2     0.0
3     1.0
4     2.0

In [29]:
df3=df2.drop('income',axis=1)
df3.head()

    age
0  25.0
1  25.0
2  35.0
3  35.0
4  30.0

In [30]:
df4=pd.concat([df3,new],axis=1)

In [31]:
df4.head()

    age  income
0  25.0     0.0
1  25.0     0.0
2  35.0     0.0
3  35.0     1.0
4  30.0     2.0

In [32]:
final=pd.concat([df1,df4],axis=1)

In [33]:
final.head()

   gender  m_status  buys   age  income
0       1         1     0  25.0     0.0
1       1         0     0  25.0     0.0
2       1         1     1  35.0     0.0
3       1         1     1  35.0     1.0
4       0         1     1  30.0     2.0